app/views/comments/_comment.html.erb

INSERT INTO `comments` (`created_at`, `updated_at`, `photo`, `email`, `name`, `body`) VALUES ('2011-04-07 21:33:34', '2011-04-07 21:33:34', NULL, 'sathishinlinux@gmail.com', 'sathish', 'hi')
---
 <span class="dateandoptions">
    Posted <%=time_ago_in_words(comment.created_at)%> ago