app/views/comments/index.html.erb

SELECT `comments`.* FROM `comments`
---
</div>
<span id="comments_count"><%= pluralize(@comments.count, "Comment") %></span>