app/views/applicants/_form.html.erb

SELECT `interviews`.* FROM `interviews`
---
    <%= f.label :Interview %><br />
   <%= f.collection_select :interview_id , Interview.all , :id ,:name %>