app/views/mandates/_form.html.erb

 <div class = "field">
    <%=collection_select :interview,:id , Interview.all, :id, :name ,{:prompt => "Select Interview "},{:class => 'interview_class', :name => 'mandate[new_interview_attributes][][id]' }%>
---
SELECT `interviews`.id FROM `interviews` WHERE (`interviews`.mandate_id = NULL)