app/views/mandates/show.html.erb

 <p>
   <% @mandate.interviews.each do |interview| %>
---
SELECT `interviews`.* FROM `interviews` WHERE (`interviews`.mandate_id = 23)