app/controllers/applicants_controller.rb

SELECT `applicants`.* FROM `applicants`
---
  def index
    @applicants = Applicant.all

SELECT `applicants`.* FROM `applicants` WHERE `applicants`.`id` = 1 LIMIT 1
---
  def show
    @applicant = Applicant.find(params[:id])

SELECT `applicants`.* FROM `applicants` WHERE `applicants`.`id` = 2 LIMIT 1
---
  def edit
    @applicant = Applicant.find(params[:id])

INSERT INTO `applicants` (`interview_id`, `name`, `created_at`, `updated_at`) VALUES (21, 'shanmugam', '2011-04-12 13:24:09', '2011-04-12 13:24:09')
---
  def create
    @applicant = Applicant.new(params[:applicant])

    respond_to do |format|
      if @applicant.save

SELECT `applicants`.* FROM `applicants` WHERE `applicants`.`id` = 3 LIMIT 1
DELETE FROM `applicants` WHERE `applicants`.`id` = 3
---
  def destroy
    @applicant = Applicant.find(params[:id])
    @applicant.destroy