app/controllers/comments_controller.rb

INSERT INTO `comments` (`created_at`, `updated_at`, `photo`, `email`, `name`, `body`) VALUES ('2011-04-07 21:33:34', '2011-04-07 21:33:34', NULL, 'sathishinlinux@gmail.com', 'sathish', 'hi')
---
  def create
    @comment = Comment.create!(params[:comment])

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 2 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 2
---
  def destroy
     @comment = Comment.find(params[:id])
     @comment.destroy