app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT `companies`.* FROM `companies`

  def show
    @company = Company.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1

  def edit
    @company = Company.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1

  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`phone_no`, `iso_standard`, `cmmi_level`, `email`, `no_of_employee`, `no_of_branch`, `address`, `website`, `domain`, `created_at`, `updated_at`, `name`) VALUES (987654332, '9004', '4', 'wiproindia@wipro.com', 768, 84, 'chennai', 'http://hrform1.heroku.com', 'PHP,Ruby,Python', '2011-04-11 06:17:50', '2011-04-11 06:17:50', 'Wipro')

  def update
    @company = Company.find(params[:id])

    respond_to do |format|
      if @company.update_attributes(params[:company])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
UPDATE `companies` SET `updated_at` = '2011-04-18 13:07:24', `latitude` = 12.9660707, `address` = 'anna nagar, chennai', `longitude` = 80.2314343 WHERE `companies`.`id` = 1

  def destroy
    @company = Company.find(params[:id])
    @company.destroy
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 4 LIMIT 1
DELETE FROM `companies` WHERE `companies`.`id` = 4