app/controllers/interviews_controller.rb

  def index
    @interviews = Interview.all
---
SELECT `interviews`.* FROM `interviews`

  def show
    @interview = Interview.find(params[:id])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 0 LIMIT 1

  def edit
    @interview = Interview.find(params[:id])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 5 LIMIT 1

  def create
    @interview = Interview.new(params[:interview])

    respond_to do |format|
      if @interview.save
---
INSERT INTO `interviews` (`name`, `updated_at`, `description`, `created_at`, `mandate_id`, `conducting_date`) VALUES ('Interview for clerk', '2011-04-09 14:31:36', 'conducted by sriram', '2011-04-09 14:31:36', 8, '2011-04-05')

  def update
    @interview = Interview.find(params[:id])

    respond_to do |format|
      if @interview.update_attributes(params[:interview])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 5 LIMIT 1
UPDATE `interviews` SET `description` = 'I am the Batch_1 member', `updated_at` = '2011-04-05 22:53:43' WHERE `interviews`.`id` = 7

  def destroy
    @interview = Interview.find(params[:id])
    @interview.destroy
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 6 LIMIT 1
DELETE FROM `interviews` WHERE `interviews`.`id` = 6