app/controllers/mandates_controller.rb

  def index
    @mandates = Mandate.all
---
SELECT `mandates`.* FROM `mandates`

  def show




    @mandate = Mandate.find(params[:id])
---
SELECT `mandates`.* FROM `mandates` WHERE `mandates`.`id` = 1 LIMIT 1

  def edit
    @mandate = Mandate.find(params[:id])
---
SELECT `mandates`.* FROM `mandates` WHERE `mandates`.`id` = 1 LIMIT 1

  def create
    @mandate = Mandate.new(params[:mandate])

    respond_to do |format|
      if @mandate.save
---
INSERT INTO `mandates` (`designation`, `created_at`, `conducting_date`, `updated_at`) VALUES ('Asst Manager', '2011-04-18 11:41:05', '2011-04-07', '2011-04-18 11:41:05')

  def update
    @mandate = Mandate.find(params[:id])
---
SELECT `mandates`.* FROM `mandates` WHERE `mandates`.`id` = 1 LIMIT 1

  def destroy
    @mandate = Mandate.find(params[:id])
    @mandate.destroy
---
SELECT `mandates`.* FROM `mandates` WHERE `mandates`.`id` = 1 LIMIT 1
DELETE FROM `mandates` WHERE `mandates`.`id` = 1

  def select_interview
   @interview= Interview.find(params[:server_value])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 0 LIMIT 1